ebay/ebay-connector/ebay-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/requests/ebay/api_setStoreCategories_negative.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ebl="urn:ebay:apis:eBLBaseComponents">
	<soapenv:Header>
		<ebl:RequesterCredentials>
			<ebl:eBayAuthToken>%s(authToken)</ebl:eBayAuthToken>
		</ebl:RequesterCredentials>
	</soapenv:Header>
	<soapenv:Body>
		<ebl:SetStoreCategoriesRequest>
			<ebl:Version>%s(version)</ebl:Version>
			<ebl:Action>INVALID</ebl:Action>
			<ebl:StoreCategories>
				<ebl:CustomCategory>
					<ebl:CategoryID>%s(customCategoryId)</ebl:CategoryID>
					<ebl:Name>%(nameMandatory)</ebl:Name>
					<ebl:Order>2</ebl:Order>
				</ebl:CustomCategory>
			</ebl:StoreCategories>
		</ebl:SetStoreCategoriesRequest>
	</soapenv:Body>
</soapenv:Envelope>